# Laboratório 4 - Gabarito

Nota: Substitua os seus nomes e informações abaixo antes do envio da atividade. A atividade deve ser enviada no `Moodle` da disciplina, e o arquivo **DEVE** estar no formato `.ipynb`.

[Nome Aluno 1] / [NUSP Aluno 1] / [Vespertino/Noturno]

[Nome Aluno 2] / [NUSP Aluno 2] / [Vespertino/Noturno]

### Exercícios

Para os exercícios, sempre é bom consultar a documentação específica do *Pandas* sobre [*Series*](https://pandas.pydata.org/docs/reference/series.html).

<p align="justify"> 1 - Filtragem com <i>Series</i> - Crie uma <i>Series</i> com números inteiros. Em seguida, crie uma nova <i>Series</i> que contenha apenas os valores maiores que 50 da primeira <i>Series</i>.

In [171]:
import pandas as pd

In [172]:
# Criando uma Series com números inteiros aleatórios
data = [45, 60, 75, 30, 90, 55, 70]
series = pd.Series(data)

# Filtrando valores maiores que 50
filtrados = series[series > 50]

print("Série original:")
print(series)
print("\nValores maiores que 50:")
print(filtrados)

Série original:
0    45
1    60
2    75
3    30
4    90
5    55
6    70
dtype: int64

Valores maiores que 50:
1    60
2    75
4    90
5    55
6    70
dtype: int64

<p align="justify"> 2 - Operações com <i>Series</i> - Primeiro, vamos criar duas <i>Series</i> com dados numéricos:

In [173]:
# Criando as duas Series
serie1 = pd.Series([10, 20, 30, 40, 50])
serie2 = pd.Series([5, 15, 25, 35, 45])

a) Some as duas <i>Series</i>:

In [174]:
soma = serie1 + serie2
print("Soma das Series:")
print(soma)

Soma das Series:
0    15
1    35
2    55
3    75
4    95
dtype: int64

b) Multiplique as <i>Series</i> uma pela outra:

In [175]:
mult = serie1 * serie2

print("Multplicação das Series: ")
print(mult)

Multplicação das Series:
0      50
1     300
2     750
3    1400
4    2250
dtype: int64

c) Encontre o valor máximo nas duas <i>Series</i>:

In [176]:
print(serie1.max())
print(serie2.max())

50
45

d) Calcule a média dos valores nas duas <i>Series</i>:

In [177]:
media_serie1 = serie1.mean()
media_serie2 = serie2.mean()

print("Média de Serie1:", media_serie1)
print("Média de Serie2:", media_serie2)

Média de Serie1: 30.0
Média de Serie2: 25.0

<p align="justify"> 3 - Crie uma <i>Series</i> com nomes de cidades e seus respectivos números de habitantes (não precisam ser dados reais). Classifique a <i>Series</i> em ordem decrescente com base no número de habitantes.

In [178]:
# Criando uma Series com nomes de cidades e seus respectivos números de habitantes
data = {'Cidade A': 750000, 'Cidade B': 610000, 'Cidade C': 850000, 'Cidade D': 420000, 'Cidade E': 320000}
series = pd.Series(data)

# Classificando a Series em ordem decrescente com base no número de habitantes
series_ordenada = series.sort_values(ascending=False)

print("Série original:")
print(series)
print("\nSérie classificada em ordem decrescente:")
print(series_ordenada)

Série original:
Cidade A    750000
Cidade B    610000
Cidade C    850000
Cidade D    420000
Cidade E    320000
dtype: int64

Série classificada em ordem decrescente:
Cidade C    850000
Cidade A    750000
Cidade B    610000
Cidade D    420000
Cidade E    320000
dtype: int64

<p align="justify">4 - Crie duas <i>Series</i> com dados de sua escolha. Concatene as duas <i>Series</i> em uma única <i>Series</i>. Certifique-se de que os índices sejam únicos após a concatenação.

In [179]:
# Criando duas Series com dados de sua escolha
serie1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
serie2 = pd.Series([4, 5, 6], index=['D', 'E', 'F'])

# Concatenando as duas Series em uma única Series
serie_concatenada = pd.concat([serie1, serie2])

print("Primeira Series:")
print(serie1)
print("\nSegunda Series:")
print(serie2)
print("\nSeries Concatenada:")
print(serie_concatenada)

Primeira Series:
A    1
B    2
C    3
dtype: int64

Segunda Series:
D    4
E    5
F    6
dtype: int64

Series Concatenada:
A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

<p align="justify">5 - No seguinte dicionário estão duas informações: o nome de políticos e a quantidade de tweets que fizeram sobre as vacinas de Covid-19 no período de janeiro de 2020 a dezembro de 2021.

<p align="justify"> Converta esse dicionário em uma <i>Serie</i> e dê as seguintes informações: qual a média de tweets, o desvio padrão e quem tweetou mais.

In [180]:
import random

# Criando o dicionário com políticos e números de tweets
politicos = {
    "Politico1": random.randint(0, 500),
    "Politico2": random.randint(0, 500),
    "Politico3": random.randint(0, 500),
    "Politico4": random.randint(0, 500),
    "Politico5": random.randint(0, 500),
    "Politico6": random.randint(0, 500),
    "Politico7": random.randint(0, 500),
    "Politico8": random.randint(0, 500),
    "Politico9": random.randint(0, 500),
    "Politico10": random.randint(0, 500),
    "Politico11": random.randint(0, 500),
    "Politico12": random.randint(0, 500),
    "Politico13": random.randint(0, 500),
    "Politico14": random.randint(0, 500),
    "Politico15": random.randint(0, 500),
    "Politico16": random.randint(0, 500),
    "Politico17": random.randint(0, 500),
    "Politico18": random.randint(0, 500),
    "Politico19": random.randint(0, 500),
    "Politico20": random.randint(0, 500)
}

# Convertendo o dicionário em uma Series
serie_politicos = pd.Series(politicos)

# Calculando a média de tweets
media_tweets = serie_politicos.mean()

# Calculando o desvio padrão dos tweets
desvio_padrao_tweets = serie_politicos.std()

# Encontrando o político que tweetou mais
politico_mais_tweets = serie_politicos.idxmax()

print("Série de Políticos e Números de Tweets:")
print(serie_politicos)
print("\nMédia de Tweets:", media_tweets)
print("Desvio Padrão dos Tweets:", desvio_padrao_tweets)
print("Político que Tweetou Mais:", politico_mais_tweets, "com", serie_politicos[politico_mais_tweets], "tweets.")

Série de Políticos e Números de Tweets:
Politico1     181
Politico2      44
Politico3     235
Politico4     199
Politico5     299
Politico6     493
Politico7     141
Politico8      66
Politico9     188
Politico10    310
Politico11    180
Politico12    223
Politico13    168
Politico14    263
Politico15     31
Politico16      5
Politico17    110
Politico18     75
Politico19    409
Politico20    319
dtype: int64

Média de Tweets: 196.95
Desvio Padrão dos Tweets: 127.55658187231018
Político que Tweetou Mais: Politico6 com 493 tweets.

<p align="justify"> 6 - Faça uma função que recebe um dicionário como argumento e retorne esse dicionário como <i>Serie</i>, junto de informações descritivas como média, moda, mediana.

In [181]:
def analisar_dicionario(dic):
    # Convertendo o dicionário em uma Series
    serie = pd.Series(dic)

    # Calculando as estatísticas descritivas
    media = serie.mean()
    moda = serie.mode().to_list()  # Pode haver mais de uma moda
    mediana = serie.median()

    # Criando um dicionário com as informações
    informacoes = {
        "Serie": serie,
        "Média": media,
        "Moda": moda,
        "Mediana": mediana
    }

    return informacoes

# Exemplo de uso da função com um dicionário fictício
dicionario_exemplo = {
    "A": 10,
    "B": 20,
    "C": 30,
    "D": 20,
    "E": 10
}

resultado = analisar_dicionario(dicionario_exemplo)
print("Informações Descritivas:")
for chave, valor in resultado.items():
    if chave == "Serie":
        print(f"{chave}:\n{valor}\n")
    else:
        print(f"{chave}: {valor}")

Informações Descritivas:
Serie:
A    10
B    20
C    30
D    20
E    10
dtype: int64

Média: 18.0
Moda: [10, 20]
Mediana: 20.0

Antes de ir aos próximos exercícios, explore a documentação própria do Pandas ([Link](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)) sobre <i>Data Frames</i>.

<p align="justify">7 - Considere o seguinte <i>Data Frame</i>:

In [182]:
dados = {
    'Nome': ['Alice', 'Bob', 'Carol', 'David', 'Eva'],
    'Idade': [25, 30, 22, 35, 28],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'São Paulo', 'Rio de Janeiro']
}

df = pd.DataFrame(dados)

df

    Nome  Idade          Cidade
0  Alice     25       São Paulo
1    Bob     30  Rio de Janeiro
2  Carol     22  Belo Horizonte
3  David     35       São Paulo
4    Eva     28  Rio de Janeiro

a) Selecione a coluna 'Nome':

In [183]:
nomes = df['Nome']
print(nomes)

0    Alice
1      Bob
2    Carol
3    David
4      Eva
Name: Nome, dtype: object

b) Selecione a primeira linha do <i>Data Frame</i>:

In [184]:
primeira_linha = df.iloc[0]
print(primeira_linha)

Nome          Alice
Idade            25
Cidade    São Paulo
Name: 0, dtype: object

c) Selecione o valor 'Bob' da coluna 'Nome':

In [185]:
nome_bob = df.loc[df['Nome'] == 'Bob', 'Nome'].values[0]
print(nome_bob)

Bob

d) Selecione as linhas onde a idade é maior que 28:

In [186]:
idade_maior_que_28 = df[df['Idade'] > 28]
print(idade_maior_que_28)

    Nome  Idade          Cidade
1    Bob     30  Rio de Janeiro
3  David     35       São Paulo

<p align="justify">e) Selecione as linhas onde a idade está entre 25 e 30 anos (inclusive) e a cidade é 'São Paulo':

In [187]:
filtro = (df['Idade'] >= 25) & (df['Idade'] <= 30) & (df['Cidade'] == 'São Paulo')
resultados = df[filtro]
print(resultados)

    Nome  Idade     Cidade
0  Alice     25  São Paulo

<p align="justify">f) Selecione as linhas onde o nome começa com a letra 'A' ou a idade é menor que 25:

<b>Dica:</b> Você vai precisar do método de strings 'startswith()' ([Link](https://docs.python.org/3/library/stdtypes.html#str.startswith)).

In [188]:
filtro = (df['Nome'].str.startswith('A')) | (df['Idade'] < 25)
resultados = df[filtro]
print(resultados)

    Nome  Idade          Cidade
0  Alice     25       São Paulo
2  Carol     22  Belo Horizonte

<p align="justify">8 - Agora vamos exercitar o uso do <i>loc</i>. Considere o seguinte <i>Data Frame</i>:

In [189]:
dados = {
    'Nome': ['Alice', 'Bob', 'Carol', 'David', 'Eva'],
    'Idade': [25, 30, 22, 35, 28],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'São Paulo', 'Rio de Janeiro']
}

df = pd.DataFrame(dados)

<p align="justify">a) Use <i>loc</i> para selecionar todas as linhas, mas só as colunas 'Nome' e 'Idade':

In [190]:
selecao_a = df.loc[:, ['Nome', 'Idade']]
print(selecao_a)

    Nome  Idade
0  Alice     25
1    Bob     30
2  Carol     22
3  David     35
4    Eva     28

<p align="justify">b) Use <i>loc</i> para selecionar a linha com o nome 'David', mas com todas as colunas:

In [191]:
selecao_b = df.loc[df['Nome'] == 'David', :]
print(selecao_b)

    Nome  Idade     Cidade
3  David     35  São Paulo

<p align="justify">c) Por fim, use <i>loc</i> para selecionar as linhas onde a idade é maior que 28 e todas as colunas:

In [192]:
selecao_c = df.loc[df['Idade'] > 28, :]
print(selecao_c)

    Nome  Idade          Cidade
1    Bob     30  Rio de Janeiro
3  David     35       São Paulo

<p align="justify">9 - Vamos trabalhar um pouco o <i>iloc</i>. Considere o mesmo <i>Data Frame</i> do exercício 2:

<p align="justify">a)  Use <i>iloc</i> para selecionar a primeira linha e todas as colunas:

In [193]:
selecao_a = df.iloc[0, :]
print(selecao_a)

Nome          Alice
Idade            25
Cidade    São Paulo
Name: 0, dtype: object

<p align="justify">b)  Use <i>iloc</i> para selecionar a última linha e todas as colunas:

In [194]:
selecao_b = df.iloc[-1, :]
print(selecao_b)

Nome                 Eva
Idade                 28
Cidade    Rio de Janeiro
Name: 4, dtype: object

<p align="justify">c) Use <i>iloc</i> para selecionar as três primeiras linhas e todas as colunas:

In [195]:
selecao_c = df.iloc[:3, :]
print(selecao_c)

    Nome  Idade          Cidade
0  Alice     25       São Paulo
1    Bob     30  Rio de Janeiro
2  Carol     22  Belo Horizonte

<p align="justify">10) Vamos criar o banco de novo para garantir que ele não foi modificado:

In [196]:
dados = {
    'Nome': ['Alice', 'Bob', 'Carol', 'David', 'Eva'],
    'Idade': [25, 30, 22, 35, 28],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'São Paulo', 'Rio de Janeiro']
}

df = pd.DataFrame(dados)

df

    Nome  Idade          Cidade
0  Alice     25       São Paulo
1    Bob     30  Rio de Janeiro
2  Carol     22  Belo Horizonte
3  David     35       São Paulo
4    Eva     28  Rio de Janeiro

<p align="justify">a) Crie uma coluna de tempo de transporte até o trabalho que vai de 15 a 90 minutos. Ela tem de ser gerada aleatoriamente:

In [197]:
df['Transporte'] = [random.randint(15, 90) for _ in range(5)]

df

    Nome  Idade          Cidade  Transporte
0  Alice     25       São Paulo          54
1    Bob     30  Rio de Janeiro          62
2  Carol     22  Belo Horizonte          62
3  David     35       São Paulo          34
4    Eva     28  Rio de Janeiro          77

b) Crie uma coluna de gênero utilizando o método np.random.choice ([Link](https://numpy.org/doc/stable/reference/random/generated/numpy.random.choice.html)):

In [198]:
import numpy as np

generos = ['masculino', 'feminino']

df['Genero'] = np.random.choice(generos, size = len(df))

df

    Nome  Idade          Cidade  Transporte     Genero
0  Alice     25       São Paulo          54  masculino
1    Bob     30  Rio de Janeiro          62   feminino
2  Carol     22  Belo Horizonte          62  masculino
3  David     35       São Paulo          34   feminino
4    Eva     28  Rio de Janeiro          77   feminino

<p align="justify">c) Crie uma coluna de salário da mesma forma que fizemos no exemplo de operações em coluna. Depois, crie uma nova coluna que mostre a razão de 'salário' e 'transporte':

In [199]:
df['Salário'] = [random.randint(1000,3000) for _ in range(len(df))]

df['salario/transporte'] = df['Salário'] / df['Transporte']

df

,Nome,Idade,Cidade,Transporte,Genero,Salário,salario/transporte
0,Alice,25,São Paulo,54,masculino,2703,50.055556
1,Bob,30,Rio de Janeiro,62,feminino,1414,22.806452
2,Carol,22,Belo Horizonte,62,masculino,1000,16.129032
3,David,35,São Paulo,34,feminino,1331,39.147059
4,Eva,28,Rio de Janeiro,77,feminino,1679,21.805195

<p align="justify">d) Delete a coluna da razão entre salário e transporte:

In [200]:
del df['salario/transporte']

df

    Nome  Idade          Cidade  Transporte     Genero  Salário
0  Alice     25       São Paulo          54  masculino     2703
1    Bob     30  Rio de Janeiro          62   feminino     1414
2  Carol     22  Belo Horizonte          62  masculino     1000
3  David     35       São Paulo          34   feminino     1331
4    Eva     28  Rio de Janeiro          77   feminino     1679

<p align="justify">11) Vamos praticar um pouco a aplicação de funções em objetos de <i>Pandas</i>. Considere o banco de dados:

In [201]:
dados = {
    'Nome': ['Alice', 'Bob', 'Carol', 'David', 'Eva'],
    'Salario': [50000, 60000, 75000, 48000, 80000],
}

df = pd.DataFrame(dados)

df

    Nome  Salario
0  Alice    50000
1    Bob    60000
2  Carol    75000
3  David    48000
4    Eva    80000

<p align="justify">a) Faça uma função chamada "aumento_salarial" que recebe o salário como entrada e retorna um aumento de 15%:

In [202]:
def aumento_salarial(x):
  return x * 1.15

b) Aplique a função na coluna "Salario" utilizando "apply":

In [203]:
df['Salario'].apply(aumento_salarial)

0    57500.0
1    69000.0
2    86250.0
3    55200.0
4    92000.0
Name: Salario, dtype: float64

<p align="justify">c) Aqui está um dicionário com um mapeamento de categorias com base nos salários. Crie uma função que retorne uma categoria de acordo com o salário da pessoa.

<b>Dica:</b> Mckinney, 2022, P. 211.

In [204]:

# Dicionário de Mapeamento

mapeamento_categorias = {
    (0, 50000): 'Baixo',
    (50001, 70000): 'Médio',
    (70001, 80000): 'Alto'
}

def mapear_categoria_salario(salario):
    for intervalo, categoria in mapeamento_categorias.items():
        if intervalo[0] <= salario <= intervalo[1]:
            return categoria

<p align="justify">d) Aplique essa função no <i>Data Frame</i>, criando uma nova coluna chamada "categoria_salario". Imprima o banco de dados:

In [205]:
df['categoria_salario'] = df["Salario"].apply(mapear_categoria_salario)

df

    Nome  Salario categoria_salario
0  Alice    50000             Baixo
1    Bob    60000             Médio
2  Carol    75000              Alto
3  David    48000             Baixo
4    Eva    80000              Alto

<p align="justify">12) Considere o seguinte <i>Data Frame</i>:

In [206]:
# Lista de nomes fictícios
nomes_brasileiros = ['João', 'Maria', 'Pedro', 'Ana', 'José', 'Luiza', 'Rafael', 'Fernanda', 'Gustavo', 'Carolina',
                     'Lucas', 'Juliana', 'Marcos', 'Camila', 'Felipe', 'Isabela', 'Mariana', 'Ricardo', 'Sandra']

# Crie um DataFrame com 20 observações aleatórias
dados = {
    'Nome': [random.choice(nomes_brasileiros) for _ in range(30)],
    'Idade': [random.randint(20, 60) for _ in range(30)],
    'Cidade': [random.choice(['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Salvador', 'Brasília']) for _ in range(30)],
    'Salario': [random.randint(1000,7000) for _ in range(30)]
}

df = pd.DataFrame(dados)

# Exiba o DataFrame
print(df)

        Nome  Idade          Cidade  Salario
0     Rafael     50        Brasília     3657
1   Fernanda     50       São Paulo     5733
2      Luiza     30  Belo Horizonte     3636
3      Luiza     56  Belo Horizonte     5560
4      Lucas     25        Salvador     1012
5       José     58        Brasília     1096
6    Isabela     30        Brasília     6055
7   Fernanda     44  Rio de Janeiro     2123
8    Juliana     51       São Paulo     2396
9     Sandra     33  Belo Horizonte     2549
10     Pedro     33  Belo Horizonte     5319
11   Ricardo     27  Rio de Janeiro     5121
12   Mariana     54        Salvador     6258
13   Ricardo     56  Rio de Janeiro     2115
14  Carolina     54       São Paulo     2839
15   Juliana     49        Salvador     4467
16      José     36        Salvador     3580
17  Fernanda     54        Brasília     1852
18     Maria     23       São Paulo     3213
19   Gustavo     43        Salvador     5543
20   Mariana     34       São Paulo     2218
21   Gustavo     41  Rio de Janeiro     6218
22   Ricardo     31        Brasília     6351
23    Camila     35  Belo Horizonte     2087
24     Luiza     27  Rio de Janeiro     2643
25    Sandra     20  Belo Horizonte     2646
26   Gustavo     56        Salvador     4243
27   Ricardo     44       São Paulo     1544
28       Ana     42        Salvador     2262
29    Felipe     45        Brasília     6643

a) Calcule a idade média e imprima o resultado como um valor inteiro

In [207]:
media = df.Idade.mean()

print(int(media))

41

b) Calcule a mediana dos salários:

In [208]:
df.Salario.median()

3396.5

<p align="justify">c) Calcule o desvio-padrão do salário e das idades e imprima de forma adequada usando <i>f strings</i>:

In [209]:
desv_sal = df.Salario.std()
desv_idade = df.Idade.std()


print(f'O Desvio Padrão do salário é de {round(desv_sal,2)} e o da Idade é {round(desv_idade,2)}')

O Desvio Padrão do salário é de 1769.65 e o da Idade é 11.49

d) Calcule a soma dos salários:

In [210]:
df.Salario.sum()

110979

e) Encontre o índice do maior valor da idade e imprima a linha:

In [211]:
indice = df.Idade.idxmax()

print(df.iloc[indice])

Nome           José
Idade            58
Cidade     Brasília
Salario        1096
Name: 5, dtype: object

<p align="justify">f) Utilize <i>describe</i> para obter estatísticas descritivas de toda a tabela:

In [212]:
df.describe()

           Idade      Salario
count  30.000000    30.000000
mean   41.033333  3699.300000
std    11.490576  1769.653524
min    20.000000  1012.000000
25%    31.500000  2229.000000
50%    42.500000  3396.500000
75%    50.750000  5487.000000
max    58.000000  6643.000000

<p align="justify">g) O <i>describe</i> também gera um <i>Data Frame</i> como resultado. Atribua o resultado do <i>describe</i> à um objeto e selecione as linhas de '25%', '50%' e '75%':

In [213]:
dados2 = df.describe()

dados2.iloc[4:7, :]

     Idade  Salario
25%  31.50   2229.0
50%  42.50   3396.5
75%  50.75   5487.0

e) Qual a correlação entre idade e salário?

In [214]:
df['Idade'].corr(df['Salario'])

0.02353026750393032

f) E a covariância destas duas variáveis?

In [215]:
df['Idade'].cov(df['Salario'])

478.47241379310384

h) Quantos nomes únicos temos no <i>Data Frame</i>?

In [216]:
# Resposta mais simples

df.Nome.unique()

array(['Rafael', 'Fernanda', 'Luiza', 'Lucas', 'José', 'Isabela',
       'Juliana', 'Sandra', 'Pedro', 'Ricardo', 'Mariana', 'Carolina',
       'Maria', 'Gustavo', 'Camila', 'Ana', 'Felipe'], dtype=object)

In [217]:
# Resposta mais elaborada

array_nomes = df.Nome.unique()

series_nomes = pd.Series(array_nomes)

series_nomes.value_counts().sum()

17

13 - Baixe o seguinte banco de dados do [Kaggle](https://www.kaggle.com/datasets/zynicide/wine-reviews?resource=download) e o importe no Colab utilizando o primeiro modo ensinado. Isto é, ir em arquivos e inserí-lo manualmente. O banco de dados é o de nome 'winemag-data-130k-v2.csv'.

<b>Dica:</b> Depois de inserí-lo, pode copiar o caminho clicando com o botão direito em cima do .csv no Colab:

In [218]:
caminho_arquivo = "dataset\\winemag-data-130k-v2.csv"

df = pd.read_csv(caminho_arquivo)

df.head()

,Unnamed: 0,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

a) Traga as principais estatísticas descritivas do banco:

In [219]:
df.describe()

          Unnamed: 0         points          price
count  129971.000000  129971.000000  120975.000000
mean    64985.000000      88.447138      35.363389
std     37519.540256       3.039730      41.022218
min         0.000000      80.000000       4.000000
25%     32492.500000      86.000000      17.000000
50%     64985.000000      88.000000      25.000000
75%     97477.500000      91.000000      42.000000
max    129970.000000     100.000000    3300.000000

b) Qual a origem mais comum dos vinhos? (Top 5)

In [220]:
df.country.value_counts()[:5]

country
US          54504
France      22093
Italy       19540
Spain        6645
Portugal     5691
Name: count, dtype: int64

c) Qual o preço médio dos vinhos?

In [221]:
df.price.mean()

35.363389129985535

d) Quem é o sommelier que mais aparece no banco?

In [222]:
df.taster_name.value_counts()[:1]

taster_name
Roger Voss    25514
Name: count, dtype: int64

14) Baixe os arquivos com os resultados das [eleições gerais](https://sig.tse.jus.br/ords/dwapr/r/seai/sig-eleicao-resultados/resultado-da-eleição?p0_abrangencia=UF&clear=RP&session=6209947300226) de 2022 por UF e importe no <i>Pandas</i> da mesma forma que o 1.

<b>Dicas:</b> Problemas no [delimiter](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) e no [encoding](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) (encoding = 'latin-1'):

In [223]:
caminho_arquivo = 'dataset\\votacao_candidato-uf_presidente_2022.csv'

df = pd.read_csv(caminho_arquivo,
                 delimiter = ';',
                 encoding = 'latin-1')

df.head()

,sg_uf,cd_cargo,ds_cargo,nr_candidato,nm_candidato,nm_urna_candidato,sg_partido,ds_composicao_coligacao,nr_turno,ds_sit_totalizacao,dt_ult_totalizacao,sg_ue,sq_candidato,nm_tipo_destinacao_votos,sq_eleicao_divulga,aa_eleicao,pc_votos_validos,qt_votos_nom_validos,qt_votos_concorrentes
0,AC,1,Presidente,22,JAIR MESSIAS BOLSONARO,JAIR BOLSONARO,PL,PP / REPUBLICANOS / PL,1,Segundo turno,2022-10-04 12:06:36,BR,280001618036,Válido,2040602022,2022,"0,625",275582,440917
1,AC,1,Presidente,13,LUIZ INÁCIO LULA DA SILVA,LULA,PT,Federação Brasil da Esperança - FE BRASIL(PT/P...,1,Segundo turno,2022-10-04 12:06:36,BR,280001607829,Válido,2040602022,2022,"0,2926",129022,440917
2,AC,1,Presidente,15,SIMONE NASSAR TEBET,SIMONE TEBET,MDB,MDB / Federação PSDB Cidadania(PSDB/CIDADANIA)...,1,Não Eleito,2022-10-04 12:06:36,BR,280001607833,Válido,2040602022,2022,"0,0456",20122,440917
3,AC,1,Presidente,12,CIRO FERREIRA GOMES,CIRO GOMES,PDT,PDT,1,Não Eleito,2022-10-04 12:06:36,BR,280001612393,Válido,2040602022,2022,"0,0279",12314,440917
4,AC,1,Presidente,44,SORAYA VIEIRA THRONICKE,SORAYA THRONICKE,UNIÃO,UNIÃO,1,Não Eleito,2022-10-04 12:06:36,BR,280001644128,Válido,2040602022,2022,"0,0055",2444,440917

a) Filtre o que é relacionado só com o cargo de presidente e no primeiro turno:

In [224]:
df = df[(df['ds_cargo'] == 'Presidente') & (df['nr_turno'] == 1)]

df

,sg_uf,cd_cargo,ds_cargo,nr_candidato,nm_candidato,nm_urna_candidato,sg_partido,ds_composicao_coligacao,nr_turno,ds_sit_totalizacao,dt_ult_totalizacao,sg_ue,sq_candidato,nm_tipo_destinacao_votos,sq_eleicao_divulga,aa_eleicao,pc_votos_validos,qt_votos_nom_validos,qt_votos_concorrentes
0,AC,1,Presidente,22,JAIR MESSIAS BOLSONARO,JAIR BOLSONARO,PL,PP / REPUBLICANOS / PL,1,Segundo turno,2022-10-04 12:06:36,BR,280001618036,Válido,2040602022,2022,"0,625",275582,440917
1,AC,1,Presidente,13,LUIZ INÁCIO LULA DA SILVA,LULA,PT,Federação Brasil da Esperança - FE BRASIL(PT/P...,1,Segundo turno,2022-10-04 12:06:36,BR,280001607829,Válido,2040602022,2022,"0,2926",129022,440917
2,AC,1,Presidente,15,SIMONE NASSAR TEBET,SIMONE TEBET,MDB,MDB / Federação PSDB Cidadania(PSDB/CIDADANIA)...,1,Não Eleito,2022-10-04 12:06:36,BR,280001607833,Válido,2040602022,2022,"0,0456",20122,440917
3,AC,1,Presidente,12,CIRO FERREIRA GOMES,CIRO GOMES,PDT,PDT,1,Não Eleito,2022-10-04 12:06:36,BR,280001612393,Válido,2040602022,2022,"0,0279",12314,440917
4,AC,1,Presidente,44,SORAYA VIEIRA THRONICKE,SORAYA THRONICKE,UNIÃO,UNIÃO,1,Não Eleito,2022-10-04 12:06:36,BR,280001644128,Válido,2040602022,2022,"0,0055",2444,440917
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
303,ZZ,1,Presidente,21,SOFIA PADUA MANZANO,SOFIA MANZANO,PCB,PCB,1,Não Eleito,2022-10-04 12:06:36,BR,280001600167,Válido,2040602022,2022,"0,0021",618,294525
304,ZZ,1,Presidente,16,VERA LUCIA PEREIRA DA SILVA SALGADO,VERA,PSTU,PSTU,1,Não Eleito,2022-10-04 12:06:36,BR,280001607831,Válido,2040602022,2022,"0,0016",464,294525
305,ZZ,1,Presidente,14,KELMON LUIS DA SILVA SOUZA,PADRE KELMON,PTB,PTB,1,Não Eleito,2022-10-04 12:06:36,BR,280001734029,Válido,2040602022,2022,"0,0012",344,294525
306,ZZ,1,Presidente,80,LEONARDO PÉRICLES VIEIRA ROQUE,LÉO PÉRICLES,UP,UP,1,Não Eleito,2022-10-04 12:06:36,BR,280001602702,Válido,2040602022,2022,"0,0011",319,294525
307,ZZ,1,Presidente,27,JOSE MARIA EYMAEL,CONSTITUINTE EYMAEL,DC,DC,1,Não Eleito,2022-10-04 12:06:36,BR,280001677435,Válido,2040602022,2022,"0,0009",258,294525

<p align="justify">b) Crie um novo <i>Data Frame</i> só com as colunas sg_uf, nm_urna_candidato, pc_votos_validos e qt_votos_nom_validos. Use 'reset_index()' para reconfigurar o índice:

In [225]:
df2 = df[['sg_uf', 'nm_urna_candidato', 'pc_votos_validos', 'qt_votos_nom_validos']].reset_index()

df2

     index sg_uf    nm_urna_candidato pc_votos_validos  qt_votos_nom_validos
0        0    AC       JAIR BOLSONARO            0,625                275582
1        1    AC                 LULA           0,2926                129022
2        2    AC         SIMONE TEBET           0,0456                 20122
3        3    AC           CIRO GOMES           0,0279                 12314
4        4    AC     SORAYA THRONICKE           0,0055                  2444
..     ...   ...                  ...              ...                   ...
303    303    ZZ        SOFIA MANZANO           0,0021                   618
304    304    ZZ                 VERA           0,0016                   464
305    305    ZZ         PADRE KELMON           0,0012                   344
306    306    ZZ         LÉO PÉRICLES           0,0011                   319
307    307    ZZ  CONSTITUINTE EYMAEL           0,0009                   258

[308 rows x 5 columns]

<p align="justify">c) Mostre o maior valor de qt_votos_nom_validos e a linha em que ocorre:

In [226]:
maior = df2.qt_votos_nom_validos.max()
linha = df2.qt_votos_nom_validos.idxmax()

print(f'O maior valor é de {maior} e ele ocorre na linha {linha}')
print(df2.iloc[275])

O maior valor é de 12239989 e ele ocorre na linha 275
index                              275
sg_uf                               SP
nm_urna_candidato       JAIR BOLSONARO
pc_votos_validos                0,4771
qt_votos_nom_validos          12239989
Name: 275, dtype: object

15) Importe "tweets_annotated.csv" do seguinte [repositório](https://github.com/PedroSchmalz/covid19-tweets-brazilian-mayoral-candidates):

In [227]:
df = pd.read_csv('https://raw.githubusercontent.com/PedroSchmalz/covid19-tweets-brazilian-mayoral-candidates/main/tweets_annotated.csv')

df

,date_post,tweet_id,content,post_vaccine,positions_vac
0,2020-03-19,1240808239224090112,Tenho duas amigas doutorandas na USP. Não estã...,1,1.0
1,2020-03-20,1241121140988410112,"Senado: Promulgado artigo que protege IBGE, Em...",0,NaN
2,2020-03-22,1241825454539120128,ATENÇÃO: programem-se para a vacinação contra ...,0,NaN
3,2020-09-01,1300918558067770112,Chega a ser inacreditável que o governo esteja...,1,1.0
4,2020-10-21,1319042054463290112,"Como prefeito, vamos garantir através da Prefe...",1,1.0
...,...,...,...,...,...
7051,2021-06-28,1409592686840066048,Com os depoimentos dos irmãos Miranda foi dado...,1,2.0
7052,2021-04-30,1388202351996150016,Muitas pessoas estão questionando por que segu...,1,2.0
7053,2021-03-19,1372931201871281920,"Gen Heleno de MÁSCARA, tomando VACINA. Cloroqu...",1,1.0
7054,2021-10-09,1446834442031575040,"As UBS Hélio Macedo, Aygara Motta, Dalmo Feito...",1,1.0
7055,2021-08-02,1422321283350639104,Acompanhei a vacinação contra covid-19 das equ...,1,1.0

<p align="justify">a) Exclua as linhas em que 'post_vaccine' é igual a 0 e salve isso em um novo <i>Data Frame</i>:

In [228]:
df2 = df[df['post_vaccine'] == 1]

df2

,date_post,tweet_id,content,post_vaccine,positions_vac
0,2020-03-19,1240808239224090112,Tenho duas amigas doutorandas na USP. Não estã...,1,1.0
3,2020-09-01,1300918558067770112,Chega a ser inacreditável que o governo esteja...,1,1.0
4,2020-10-21,1319042054463290112,"Como prefeito, vamos garantir através da Prefe...",1,1.0
5,2020-11-17,1328772384585860096,"E reafirmando o compromisso de, como Prefeito,...",1,1.0
6,2020-11-19,1329419704847490048,Égua já pensaste?! Não sei se dá pra ser assim...,1,1.0
...,...,...,...,...,...
7051,2021-06-28,1409592686840066048,Com os depoimentos dos irmãos Miranda foi dado...,1,2.0
7052,2021-04-30,1388202351996150016,Muitas pessoas estão questionando por que segu...,1,2.0
7053,2021-03-19,1372931201871281920,"Gen Heleno de MÁSCARA, tomando VACINA. Cloroqu...",1,1.0
7054,2021-10-09,1446834442031575040,"As UBS Hélio Macedo, Aygara Motta, Dalmo Feito...",1,1.0
7055,2021-08-02,1422321283350639104,Acompanhei a vacinação contra covid-19 das equ...,1,1.0

<p align="justify">b) Use o <i>Data Frame</i> do exercício anterior para mostrar as frequências das categorias da variável 'positions_vac':

In [229]:
df2['positions_vac'].value_counts()

positions_vac
1.0    3999
2.0    2167
3.0     252
0.0       1
Name: count, dtype: int64

16 - Temos o seguinte banco de dados com valores <i>missing</i>. Preencha os valores faltantes com zeros.

In [230]:
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [np.nan, 2, 3, np.nan, 5],
        'C': [1, np.nan, 3, 4, np.nan]}

df = pd.DataFrame(data)


# Preencher os valores ausentes com zeros
df_filled = df.fillna(0)

# Exibir o DataFrame com os valores preenchidos
print(df_filled)

     A    B    C
0  1.0  0.0  1.0
1  2.0  2.0  0.0
2  0.0  3.0  3.0
3  4.0  0.0  4.0
4  5.0  5.0  0.0

17 - Novamente, temos um banco de dados com NAs. Conte os valores <i>missing</i> em cada coluna:

In [231]:
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [np.nan, 2, 3, np.nan, 5],
        'C': [1, np.nan, 3, 4, np.nan]}

df = pd.DataFrame(data)


# Contar os valores ausentes em cada coluna
count_missing = df.isnull().sum()

# Exibir o número de valores ausentes em cada coluna
print(count_missing)

A    1
B    2
C    2
dtype: int64

18 - Remova os dados duplicados do seguinte banco de dados:

In [232]:
data = {'Nome': ['Alice', 'Bob', 'Alice', 'David', 'Eve'],
        'ID': [101, 102, 101, 103, 104]}

df = pd.DataFrame(data)

# Remova as entradas duplicadas com base no número de identificação
df_unique = df.drop_duplicates(subset='ID')

# Exiba o novo DataFrame resultante
print(df_unique)

    Nome   ID
0  Alice  101
1    Bob  102
3  David  103
4    Eve  104

<p align="justify">19 - Para o seguinte banco de dados, faça um mapeamento que substitua 'alto' por 3, 'médio' por 2 e 'baixo' por 1. Em seguida, utilize esse mapeamento no banco com o método <i>replace</i>:

In [233]:

data = {'Cidade': ['A', 'B', 'C', 'D'],
        'Poluição': ['Alto', 'Médio', 'Baixo', 'Alto']}

df = pd.DataFrame(data)

# Mapeie as representações de texto para valores numéricos
mapeamento = {'Alto': 3, 'Médio': 2, 'Baixo': 1}
df['Poluição'] = df['Poluição'].replace(mapeamento)

# Exiba o DataFrame após a substituição
print(df)

  Cidade  Poluição
0      A         3
1      B         2
2      C         1
3      D         3

C:\Users\Pedro\AppData\Local\Temp\ipykernel_12596\2138040299.py:8: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Poluição'] = df['Poluição'].replace(mapeamento)

<p align="justify">20 - Para o seguinte banco de dados, crie bins de conceitos (i.e. 'A', 'B', etc.) com base na nota dos alunos:

In [234]:

data = {'Nome': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
        'Nota': [85, 72, 45, 60, 32]}

df = pd.DataFrame(data)

# Defina os intervalos das notas
faixas_etarias = [0, 18, 40, 60, 84, float('inf')]  # Intervalos

# Crie uma nova coluna com as faixas etárias
df['Conceito'] = pd.cut(df['Nota'], bins=faixas_etarias, labels=['E', 'D', 'C', 'B', 'A'])


df

    Nome  Nota Conceito
0  Alice    85        A
1    Bob    72        B
2  Carol    45        C
3  David    60        C
4    Eve    32        D

21 - Use a função get_dummies() para criar variáveis dummy a partir da coluna de animais de estimação:

In [235]:
data = {'Nome': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
        'Animal_de_Estimação': ['Cachorro', 'Gato', 'Peixe', 'Gato', 'Cachorro']}

df = pd.DataFrame(data)

# Crie variáveis dummy para o tipo de animal de estimação
df_dummies = pd.get_dummies(df['Animal_de_Estimação'])

# Concatene as variáveis dummy com o DataFrame original
df = pd.concat([df, df_dummies], axis=1)

# Exiba o DataFrame com as novas variáveis dummy
print(df)

    Nome Animal_de_Estimação  Cachorro   Gato  Peixe
0  Alice            Cachorro      True  False  False
1    Bob                Gato     False   True  False
2  Carol               Peixe     False  False   True
3  David                Gato     False   True  False
4    Eve            Cachorro      True  False  False

<p align="justify">22 - Suponha que você tenha um <i>Data Frame</i> com uma coluna que contém nomes completos no formato "Primeiro Nome Último Nome". Sua tarefa é dividir essa coluna em duas colunas separadas, uma para o primeiro nome e outra para o último nome:

In [236]:
import pandas as pd

data = {'Nome_Completo': ['Alice Johnson', 'Bob Smith', 'Carol Brown', 'David White', 'Eve Anderson']}

df = pd.DataFrame(data)

# Divida a coluna "Nome_Completo" em "Primeiro_Nome" e "Último_Nome"
df[['Primeiro_Nome', 'Último_Nome']] = df['Nome_Completo'].str.split(' ', n=1, expand=True)

print(df)

   Nome_Completo Primeiro_Nome Último_Nome
0  Alice Johnson         Alice     Johnson
1      Bob Smith           Bob       Smith
2    Carol Brown         Carol       Brown
3    David White         David       White
4   Eve Anderson           Eve    Anderson

<p align="justify">23 - Suponha que você tenha um <i>Data Frame</i> com uma coluna que contém nomes completos, mas alguns nomes têm espaços em branco extras no início ou no final. Sua tarefa é remover esses espaços em branco extras:

In [237]:
data = {'Nome_Completo': ['   Alice Johnson', 'Bob Smith   ', ' Carol Brown ', '  David White ', 'Eve  Anderson']}

df = pd.DataFrame(data)

# Remova espaços em branco extras no início e no final dos nomes
df['Nome_Completo'] = df['Nome_Completo'].str.strip()

# Exiba o DataFrame com os nomes limpos
print(df)

   Nome_Completo
0  Alice Johnson
1      Bob Smith
2    Carol Brown
3    David White
4  Eve  Anderson